Revit 2027 API
BarTypeDiameterOptions.StandardHookBendDiameter Property
 Represents the standard hook bend diameter of the RebarBarType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double StandardHookBendDiameter { get; set; }
Public Property StandardHookBendDiameter As Double
	Get
	Set
public:
property double StandardHookBendDiameter {
	double get ();
	void set (double value);
}
member StandardHookBendDiameter : float with get, set
Property Value
Double
See Also
Reference
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace